name:
Singer Heavy Duty 4452 Sewing Machine With Accessories, 32 Built-In Stitches, 60% Stronger Motor, Stainless Steel Bedplate, 48% Faster Stitching Speed & Automatic Needle Threader

categories:
sewing, machine, sewing machine, stainless, steel, stainless steel, automatic needle threader

mainPicture:

pictures:

description:
1) SINGER HEAVY DUTY SEWING MACHINE: The SINGER Heavy Duty 4452 sewing machine boasts an array of features that make creating elegant garments and gifts for yourself and others fun and exciting. The Sewing machine with 32 built-in stitches includes 6 Basic, 7 Stretch, 18 Decorative Stitches and 1 Fully Automatic 1-step Buttonholes. A large variety of stitches for all types of sewing and perfect for crafts, home decor, clothing construction and much more
2) AUTOMATIC NEEDLE THREADER SEWING MACHINE: After following the threading path printed right on the machine, this built-in feature helps you to effortlessly thread the eye of the needle without eye strain or frustration, Machine Size - 15.5 x 6.25 x 12 inches
3) HIGH-SPEED SEWING MACHINE: The Singer 4452 sewing machine has a maximum sewing speed of 1,100 stitches-per-minute, so projects can be sewn quickly. The 60% Stronger Motor than standard sewing machines allows it to sew through heavyweight fabrics with ease
4) SEWING MACHINE ACCESSORIES: Four bonus Heavy Duty optimized accessories included: Even Feed / Walking Foot for layers of fabric, Non-Stick Foot for leather and vinyl, a 5-pack of Size 16 needles and a Clearance Plate for thick seams. Plus a variety of must-have accessories are included with all-purpose foot, zipper foot, buttonhole foot, button sewing foot, seam ripper / lint brush, quilting guide, needles, bobbins, screwdriver, auxiliary spool pin, spool pin felt are all conveniently located and stored in the accessory tray. A soft-sided dust cover is also included in the packaging
5) BEST SELLING SEWING MACHINE: The SINGER Heavy Duty 4452 sewing machine is a true workhorse. The stainless steel bedplate enables smooth fabric flow and the heavy duty interior metal frame ensures skip-free sewing. Top drop-in bobbin is easy to insert, remove and monitor thread supply
6) This sewing machine is warranted for use in the US and Canada at 110 volts only
7) Amps (0.7) / Watts (120) / Volts (120V) / Hertz (60)