name:
Target Superstore

physicalAddress:
1000 Nicollet Mall
Minneapolis, Minnesota 55403

mailingAddress:
Post Office Box 12345
Minneapolis, Minnesota 55403

website:
https://www.target.com

email:
CorporateResponsibility@target.com

phone:
(800) 440-0680

fax:


picture:


description:
Target Corporation is the eighth-largest retailer in the United States, and is a component of the S&P 500 Index.[4] Founded by George Dayton and headquartered in Minneapolis, the company was originally named Goodfellow Dry Goods in June 1902 before being renamed the Dayton's Dry Goods Company in 1903 and later the Dayton Company in 1910. The first Target store opened in Roseville, Minnesota in 1962 while the parent company was renamed the Dayton Corporation in 1967. It became the Dayton-Hudson Corporation after merging with the J.L. Hudson Company in 1969 and held ownership of several department store chains including Dayton's, Hudson's, Marshall Field's, and Mervyn's. It is unrelated to Target Australia.

Target established itself as the day time division of the Dayton-Hudson Corporation in the 1970s; it began expanding the store nationwide in the 1980s and introduced new store formats under the Target brand in the 1990s. The company has found success as a cheap-chic player in the industry.[5] The parent company was renamed the Target Corporation in 2000 and divested itself of its last department store chains in 2004. It suffered from a massive and highly publicized security breach of customer credit card data and the failure of its short-lived Target Canada subsidiary in the early 2010s but experienced revitalized success with its expansion in urban markets within the United States. As of February 2nd, 2019, Target operates 1,844[2] stores throughout the United States. The company is ranked No. 39 on the 2018 Fortune 500 list of the largest United States corporations by total revenue.[6] Their retail formats include the discount store Target, the hypermarket SuperTarget, and "small-format" stores previously named CityTarget and TargetExpress before being consolidated under the Target branding. Target is often recognized for its emphasis on "the needs of its younger, image-conscious shoppers", whereas its rival Walmart more heavily relies on its strategy of "always low prices".[7]