name:
Wafa Hamoudi

physicalAddress:
122 East 42nd Street
New York, New York 10168-1289
USA

mailingAddress:
122 East 42nd Street
New York, New York 10168-1289
USA

website:
https://www.sfcg.org/beyond-labels-woman-mediator-yemen

email:
WafaHamoudi@outlook.com

phone:
(212) 551-3000

fax:
(212) 551-3179

picture:

description:
BEYOND LABELS: HOW A WOMAN MEDIATOR CHALLENGED GENDER STEREOTYPES IN YEMEN
“Being a woman here, everything is challenging. Everything,” said Wafa Hamoudi, a pioneering Yemeni mediator and facilitator. Born and raised in one of Yemen’s most conservative communities, her work as a peacebuilding leader during Yemen’s ongoing war has been fraught with challenges.

In Yemen, women are often only allowed to work in specific professions that feature minor interactions with men, like teaching in female schools or working as nurses under female doctors. Wafa wanted to break that mold but did not know how. That’s where our Yemen office came into play.

As a professional teacher and school principal, we selected Wafa to participate as a lead facilitator and trainer during our project, Enhancing Resilience in Rural Yemen, funded by UNDP and the European Union. She seized this opportunity. Wafa went against the grain to become an indispensable leader of the local mediator team, bringing peaceful conflict resolution to her district.

The road to leadership was not easy. As Wafa points out in the video, nothing is easy for women in Yemen. She persisted in communicating with the men in her district who could not accept her position of power. Wafa won the trust of entire communities and government officials, including the District Director, until she became the driving force for peacebuilding projects in her area.

Throughout her journey to empowerment, not only has Wafa gained confidence in her own abilities; she also opened the door for many more local Yemeni women to follow in her footsteps. She has widened her male counterparts’ eyes to the powerful contributions of women in leadership positions and won the hearts of all those she has worked with to lessen the suffering of local Yemeni communities. “I think the challenges I faced in my work with Search only made me stronger,” she said.